; ModuleID = 'extracted.c'
source_filename = "extracted.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, %struct.ctl_value*, [16 x i32]*, [0 x i32]* }
%struct.ctl_value = type { %union.anon }
%union.anon = type { i64 }
%struct.anon.0 = type { [1 x i32]*, %struct.vip_definition*, %struct.vip_meta*, [512 x i32]*, [0 x i32]* }
%struct.vip_definition = type { %union.anon.1, i16, i8 }
%union.anon.1 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.anon.2 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.3 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]*, [0 x i32]* }
%struct.flow_key = type { %union.anon.4, %union.anon.5, %union.anon.6, i8 }
%union.anon.4 = type { [4 x i32] }
%union.anon.5 = type { [4 x i32] }
%union.anon.6 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.anon.7 = type { [2 x i32]*, i32*, i32*, [33554944 x i32]*, [0 x i32]* }
%struct.anon.8 = type { [2 x i32]*, i32*, %struct.real_definition*, [4096 x i32]*, [0 x i32]* }
%struct.real_definition = type { %union.anon.9, i8 }
%union.anon.9 = type { [4 x i32] }
%struct.anon.10 = type { [6 x i32]*, i32*, %struct.lb_stats*, [4096 x i32]*, [0 x i32]* }
%struct.lb_stats = type { i64, i64 }
%struct.anon.11 = type { [6 x i32]*, i32*, %struct.lb_stats*, [1024 x i32]*, [0 x i32]* }
%struct.anon.12 = type { [2 x i32]*, i32*, i32*, [16777214 x i32]*, [0 x i32]* }
%struct.anon.13 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.14 = type { [6 x i32]*, i32*, %struct.decap_stats*, [1024 x i32]*, [0 x i32]* }
%struct.decap_stats = type { i64, i64, i64 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@ctl_array = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !6
@vip_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !50
@lru_mapping = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !90
@fallback_cache = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !109
@ch_rings = dso_local global %struct.anon.7 zeroinitializer, section ".maps", align 8, !dbg !151
@reals = dso_local global %struct.anon.8 zeroinitializer, section ".maps", align 8, !dbg !164
@reals_stats = dso_local global %struct.anon.10 zeroinitializer, section ".maps", align 8, !dbg !186
@stats = dso_local global %struct.anon.11 zeroinitializer, section ".maps", align 8, !dbg !202
@server_id_map = dso_local global %struct.anon.12 zeroinitializer, section ".maps", align 8, !dbg !215
@flow_debug_maps = dso_local global %struct.anon.13 zeroinitializer, section ".maps", align 8, !dbg !228
@decap_counters = dso_local global %struct.anon.14 zeroinitializer, section ".maps", align 8, !dbg !238
@llvm.used = appending global [12 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.anon.7* @ch_rings to i8*), i8* bitcast (%struct.anon* @ctl_array to i8*), i8* bitcast (%struct.anon.14* @decap_counters to i8*), i8* bitcast (%struct.anon.3* @fallback_cache to i8*), i8* bitcast (%struct.anon.13* @flow_debug_maps to i8*), i8* bitcast (%struct.anon.2* @lru_mapping to i8*), i8* bitcast (%struct.anon.8* @reals to i8*), i8* bitcast (%struct.anon.10* @reals_stats to i8*), i8* bitcast (%struct.anon.12* @server_id_map to i8*), i8* bitcast (%struct.anon.11* @stats to i8*), i8* bitcast (%struct.anon.0* @vip_map to i8*)], section "llvm.metadata"

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!256, !257, !258}
!llvm.ident = !{!259}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 424, type: !254, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "extracted.c", directory: "/home/sayandes/codequery/extraction")
!4 = !{}
!5 = !{!0, !6, !50, !90, !109, !151, !164, !186, !202, !215, !228, !238}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !8, line: 41, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "./control_data_maps.h", directory: "/home/sayandes/codequery/extraction")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 35, size: 320, elements: !10)
!10 = !{!11, !17, !22, !40, !45}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 36, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !15)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!16}
!16 = !DISubrange(count: 2)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !9, file: !8, line: 37, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !9, file: !8, line: 38, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !25, line: 53, size: 64, elements: !26)
!25 = !DIFile(filename: "./balancer_structs.h", directory: "/home/sayandes/codequery/extraction")
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !25, line: 54, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !24, file: !25, line: 54, size: 64, elements: !29)
!29 = !{!30, !33, !34}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !28, file: !25, line: 55, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !28, file: !25, line: 56, baseType: !19, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !28, file: !25, line: 57, baseType: !35, size: 48)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 48, elements: !38)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 6)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !9, file: !8, line: 39, baseType: !41, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !9, file: !8, line: 40, baseType: !46, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 0)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !52, line: 38, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "./balancer_maps.h", directory: "/home/sayandes/codequery/extraction")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 32, size: 320, elements: !54)
!54 = !{!55, !60, !78, !84, !89}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 33, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 1)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !53, file: !52, line: 34, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !25, line: 62, size: 160, elements: !63)
!63 = !{!64, !74, !77}
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !62, file: !25, line: 63, baseType: !65, size: 128)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !25, line: 63, size: 128, elements: !66)
!66 = !{!67, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !65, file: !25, line: 64, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !69, line: 27, baseType: !19)
!69 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !65, file: !25, line: 65, baseType: !71, size: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !62, file: !25, line: 67, baseType: !75, size: 16, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !76)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !62, file: !25, line: 68, baseType: !36, size: 8, offset: 144)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !53, file: !52, line: 35, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !25, line: 72, size: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !80, file: !25, line: 73, baseType: !19, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !80, file: !25, line: 74, baseType: !19, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !53, file: !52, line: 36, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 16384, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !53, file: !52, line: 37, baseType: !46, size: 64, offset: 256)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !52, line: 47, type: !92, isLocal: false, isDefinition: true)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 41, size: 320, elements: !93)
!93 = !{!94, !99, !102, !103, !108}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !52, line: 42, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 384, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 12)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !92, file: !52, line: 43, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !92, file: !52, line: 44, baseType: !100, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !92, file: !52, line: 45, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 4096, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !92, file: !52, line: 46, baseType: !46, size: 64, offset: 256)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !52, line: 56, type: !111, isLocal: false, isDefinition: true)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 50, size: 320, elements: !112)
!112 = !{!113, !118, !139, !145, !150}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !52, line: 51, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 288, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 9)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !111, file: !52, line: 52, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !25, line: 26, size: 320, elements: !121)
!121 = !{!122, !127, !132, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !25, line: 27, baseType: !123, size: 128)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !25, line: 27, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !123, file: !25, line: 28, baseType: !68, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !123, file: !25, line: 29, baseType: !71, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !25, line: 31, baseType: !128, size: 128, offset: 128)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !25, line: 31, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !128, file: !25, line: 32, baseType: !68, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !128, file: !25, line: 33, baseType: !71, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !25, line: 35, baseType: !133, size: 32, offset: 256)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !25, line: 35, size: 32, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !133, file: !25, line: 36, baseType: !19, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !133, file: !25, line: 37, baseType: !137, size: 32)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !15)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !120, file: !25, line: 39, baseType: !36, size: 8, offset: 288)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !111, file: !52, line: 53, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !25, line: 78, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !141, file: !25, line: 79, baseType: !19, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !141, file: !25, line: 80, baseType: !31, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !111, file: !52, line: 54, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32000, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1000)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !111, file: !52, line: 55, baseType: !46, size: 64, offset: 256)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !52, line: 65, type: !153, isLocal: false, isDefinition: true)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 59, size: 320, elements: !154)
!154 = !{!155, !156, !157, !158, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !52, line: 60, baseType: !12, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !153, file: !52, line: 61, baseType: !18, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !153, file: !52, line: 62, baseType: !18, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !153, file: !52, line: 63, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1073758208, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 33554944)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !153, file: !52, line: 64, baseType: !46, size: 64, offset: 256)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !52, line: 74, type: !166, isLocal: false, isDefinition: true)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 68, size: 320, elements: !167)
!167 = !{!168, !169, !170, !180, !185}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !52, line: 69, baseType: !12, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !52, line: 70, baseType: !18, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !166, file: !52, line: 71, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !25, line: 84, size: 160, elements: !173)
!173 = !{!174, !179}
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !25, line: 85, baseType: !175, size: 128)
!175 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !172, file: !25, line: 85, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !175, file: !25, line: 86, baseType: !68, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !175, file: !25, line: 87, baseType: !71, size: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !25, line: 89, baseType: !36, size: 8, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !166, file: !52, line: 72, baseType: !181, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 131072, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 4096)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !166, file: !52, line: 73, baseType: !46, size: 64, offset: 256)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !52, line: 83, type: !188, isLocal: false, isDefinition: true)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 77, size: 320, elements: !189)
!189 = !{!190, !193, !194, !200, !201}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !52, line: 78, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !38)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !188, file: !52, line: 79, baseType: !18, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !52, line: 80, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !25, line: 93, size: 128, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !196, file: !25, line: 94, baseType: !31, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !196, file: !25, line: 95, baseType: !31, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !188, file: !52, line: 81, baseType: !181, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !188, file: !52, line: 82, baseType: !46, size: 64, offset: 256)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !52, line: 92, type: !204, isLocal: false, isDefinition: true)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 86, size: 320, elements: !205)
!205 = !{!206, !207, !208, !209, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !52, line: 87, baseType: !191, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !204, file: !52, line: 88, baseType: !18, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !52, line: 89, baseType: !195, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !204, file: !52, line: 90, baseType: !210, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32768, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !204, file: !52, line: 91, baseType: !46, size: 64, offset: 256)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !52, line: 102, type: !217, isLocal: false, isDefinition: true)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 96, size: 320, elements: !218)
!218 = !{!219, !220, !221, !222, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !52, line: 97, baseType: !12, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !217, file: !52, line: 98, baseType: !18, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !52, line: 99, baseType: !18, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !217, file: !52, line: 100, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 536870848, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 16777214)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !217, file: !52, line: 101, baseType: !46, size: 64, offset: 256)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "flow_debug_maps", scope: !2, file: !230, line: 31, type: !231, isLocal: false, isDefinition: true)
!230 = !DIFile(filename: "./flow_debug_maps.h", directory: "/home/sayandes/codequery/extraction")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 25, size: 320, elements: !232)
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !230, line: 26, baseType: !95, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !231, file: !230, line: 27, baseType: !100, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !231, file: !230, line: 28, baseType: !100, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !231, file: !230, line: 29, baseType: !104, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !231, file: !230, line: 30, baseType: !46, size: 64, offset: 256)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "decap_counters", scope: !2, file: !240, line: 44, type: !241, isLocal: false, isDefinition: true)
!240 = !DIFile(filename: "./decap_maps.h", directory: "/home/sayandes/codequery/extraction")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 38, size: 320, elements: !242)
!242 = !{!243, !244, !245, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !240, line: 39, baseType: !191, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !241, file: !240, line: 40, baseType: !18, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !240, line: 41, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decap_stats", file: !240, line: 31, size: 192, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v4", scope: !247, file: !240, line: 32, baseType: !31, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v6", scope: !247, file: !240, line: 33, baseType: !31, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !247, file: !240, line: 34, baseType: !31, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !241, file: !240, line: 42, baseType: !210, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !241, file: !240, line: 43, baseType: !46, size: 64, offset: 256)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 32, elements: !72)
!255 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!256 = !{i32 7, !"Dwarf Version", i32 4}
!257 = !{i32 2, !"Debug Info Version", i32 3}
!258 = !{i32 1, !"wchar_size", i32 4}
!259 = !{!"clang version 10.0.0-4ubuntu1 "}
