; ModuleID = 'extracted.c'
source_filename = "extracted.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, %struct.ctl_value*, [16 x i32]*, [0 x i32]* }
%struct.ctl_value = type { %union.anon }
%union.anon = type { i64 }
%struct.anon.0 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.1 = type { [1 x i32]*, %struct.vip_definition*, %struct.vip_meta*, [512 x i32]*, [0 x i32]* }
%struct.vip_definition = type { %union.anon.2, i16, i8 }
%union.anon.2 = type { [4 x i32] }
%struct.vip_meta = type { i32, i32 }
%struct.anon.3 = type { [12 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [0 x i32]* }
%struct.anon.4 = type { [9 x i32]*, %struct.flow_key*, %struct.real_pos_lru*, [1000 x i32]*, [0 x i32]* }
%struct.flow_key = type { %union.anon.5, %union.anon.6, %union.anon.7, i8 }
%union.anon.5 = type { [4 x i32] }
%union.anon.6 = type { [4 x i32] }
%union.anon.7 = type { i32 }
%struct.real_pos_lru = type { i32, i64 }
%struct.anon.8 = type { [2 x i32]*, i32*, i32*, [33554944 x i32]*, [0 x i32]* }
%struct.anon.9 = type { [2 x i32]*, i32*, %struct.real_definition*, [4096 x i32]*, [0 x i32]* }
%struct.real_definition = type { %union.anon.10, i8 }
%union.anon.10 = type { [4 x i32] }
%struct.anon.11 = type { [6 x i32]*, i32*, %struct.lb_stats*, [4096 x i32]*, [0 x i32]* }
%struct.lb_stats = type { i64, i64 }
%struct.anon.12 = type { [6 x i32]*, i32*, %struct.lb_stats*, [1024 x i32]*, [0 x i32]* }
%struct.anon.13 = type { [2 x i32]*, i32*, i32*, [16777214 x i32]*, [0 x i32]* }
%struct.anon.14 = type { [6 x i32]*, i32*, %struct.decap_stats*, [1024 x i32]*, [0 x i32]* }
%struct.decap_stats = type { i64, i64, i64 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@ctl_array = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !6
@flow_debug_maps = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !50
@vip_map = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !72
@lru_mapping = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !110
@fallback_cache = dso_local global %struct.anon.4 zeroinitializer, section ".maps", align 8, !dbg !119
@ch_rings = dso_local global %struct.anon.8 zeroinitializer, section ".maps", align 8, !dbg !161
@reals = dso_local global %struct.anon.9 zeroinitializer, section ".maps", align 8, !dbg !174
@reals_stats = dso_local global %struct.anon.11 zeroinitializer, section ".maps", align 8, !dbg !196
@stats = dso_local global %struct.anon.12 zeroinitializer, section ".maps", align 8, !dbg !212
@server_id_map = dso_local global %struct.anon.13 zeroinitializer, section ".maps", align 8, !dbg !225
@decap_counters = dso_local global %struct.anon.14 zeroinitializer, section ".maps", align 8, !dbg !238
@llvm.used = appending global [12 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.anon.8* @ch_rings to i8*), i8* bitcast (%struct.anon* @ctl_array to i8*), i8* bitcast (%struct.anon.14* @decap_counters to i8*), i8* bitcast (%struct.anon.4* @fallback_cache to i8*), i8* bitcast (%struct.anon.0* @flow_debug_maps to i8*), i8* bitcast (%struct.anon.3* @lru_mapping to i8*), i8* bitcast (%struct.anon.9* @reals to i8*), i8* bitcast (%struct.anon.11* @reals_stats to i8*), i8* bitcast (%struct.anon.13* @server_id_map to i8*), i8* bitcast (%struct.anon.12* @stats to i8*), i8* bitcast (%struct.anon.1* @vip_map to i8*)], section "llvm.metadata"

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!256, !257, !258}
!llvm.ident = !{!259}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 490, type: !254, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "extracted.c", directory: "/home/sayandes/codequery/extraction")
!4 = !{}
!5 = !{!0, !6, !50, !72, !110, !119, !161, !174, !196, !212, !225, !238}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "ctl_array", scope: !2, file: !8, line: 41, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "./control_data_maps.h", directory: "/home/sayandes/codequery/extraction")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 35, size: 320, elements: !10)
!10 = !{!11, !17, !22, !40, !45}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 36, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 64, elements: !15)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!16}
!16 = !DISubrange(count: 2)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !9, file: !8, line: 37, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !9, file: !8, line: 38, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_value", file: !25, line: 53, size: 64, elements: !26)
!25 = !DIFile(filename: "./balancer_structs.h", directory: "/home/sayandes/codequery/extraction")
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !25, line: 54, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !24, file: !25, line: 54, size: 64, elements: !29)
!29 = !{!30, !33, !34}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !28, file: !25, line: 55, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !28, file: !25, line: 56, baseType: !19, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !28, file: !25, line: 57, baseType: !35, size: 48)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 48, elements: !38)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 6)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !9, file: !8, line: 39, baseType: !41, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !9, file: !8, line: 40, baseType: !46, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 0)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "flow_debug_maps", scope: !2, file: !52, line: 31, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "./flow_debug_maps.h", directory: "/home/sayandes/codequery/extraction")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 25, size: 320, elements: !54)
!54 = !{!55, !60, !65, !66, !71}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 26, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 384, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 12)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !53, file: !52, line: 27, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 4)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !53, file: !52, line: 28, baseType: !61, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !53, file: !52, line: 29, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 4096, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !53, file: !52, line: 30, baseType: !46, size: 64, offset: 256)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "vip_map", scope: !2, file: !74, line: 38, type: !75, isLocal: false, isDefinition: true)
!74 = !DIFile(filename: "./balancer_maps.h", directory: "/home/sayandes/codequery/extraction")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 32, size: 320, elements: !76)
!76 = !{!77, !82, !98, !104, !109}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !74, line: 33, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !75, file: !74, line: 34, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_definition", file: !25, line: 62, size: 160, elements: !85)
!85 = !{!86, !94, !97}
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !84, file: !25, line: 63, baseType: !87, size: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !84, file: !25, line: 63, size: 128, elements: !88)
!88 = !{!89, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !87, file: !25, line: 64, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !91, line: 27, baseType: !19)
!91 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "vipv6", scope: !87, file: !25, line: 65, baseType: !93, size: 128)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !63)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !84, file: !25, line: 67, baseType: !95, size: 16, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !96)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !84, file: !25, line: 68, baseType: !36, size: 8, offset: 144)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !75, file: !74, line: 35, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vip_meta", file: !25, line: 72, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !25, line: 73, baseType: !19, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "vip_num", scope: !100, file: !25, line: 74, baseType: !19, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !75, file: !74, line: 36, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 16384, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !75, file: !74, line: 37, baseType: !46, size: 64, offset: 256)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "lru_mapping", scope: !2, file: !74, line: 47, type: !112, isLocal: false, isDefinition: true)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 41, size: 320, elements: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !74, line: 42, baseType: !56, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !112, file: !74, line: 43, baseType: !61, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !112, file: !74, line: 44, baseType: !61, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !112, file: !74, line: 45, baseType: !67, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !112, file: !74, line: 46, baseType: !46, size: 64, offset: 256)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "fallback_cache", scope: !2, file: !74, line: 56, type: !121, isLocal: false, isDefinition: true)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 50, size: 320, elements: !122)
!122 = !{!123, !128, !149, !155, !160}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !74, line: 51, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 288, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 9)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !121, file: !74, line: 52, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_key", file: !25, line: 26, size: 320, elements: !131)
!131 = !{!132, !137, !142, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !25, line: 27, baseType: !133, size: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !25, line: 27, size: 128, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !133, file: !25, line: 28, baseType: !90, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "srcv6", scope: !133, file: !25, line: 29, baseType: !93, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !25, line: 31, baseType: !138, size: 128, offset: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !25, line: 31, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !138, file: !25, line: 32, baseType: !90, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !138, file: !25, line: 33, baseType: !93, size: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !25, line: 35, baseType: !143, size: 32, offset: 256)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !25, line: 35, size: 32, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ports", scope: !143, file: !25, line: 36, baseType: !19, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "port16", scope: !143, file: !25, line: 37, baseType: !147, size: 32)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 32, elements: !15)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !130, file: !25, line: 39, baseType: !36, size: 8, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !121, file: !74, line: 53, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_pos_lru", file: !25, line: 78, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !151, file: !25, line: 79, baseType: !19, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !151, file: !25, line: 80, baseType: !31, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !121, file: !74, line: 54, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32000, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 1000)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !121, file: !74, line: 55, baseType: !46, size: 64, offset: 256)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "ch_rings", scope: !2, file: !74, line: 65, type: !163, isLocal: false, isDefinition: true)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 59, size: 320, elements: !164)
!164 = !{!165, !166, !167, !168, !173}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !74, line: 60, baseType: !12, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !163, file: !74, line: 61, baseType: !18, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !163, file: !74, line: 62, baseType: !18, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !163, file: !74, line: 63, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1073758208, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 33554944)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !163, file: !74, line: 64, baseType: !46, size: 64, offset: 256)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "reals", scope: !2, file: !74, line: 74, type: !176, isLocal: false, isDefinition: true)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 68, size: 320, elements: !177)
!177 = !{!178, !179, !180, !190, !195}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !74, line: 69, baseType: !12, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !176, file: !74, line: 70, baseType: !18, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !176, file: !74, line: 71, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_definition", file: !25, line: 84, size: 160, elements: !183)
!183 = !{!184, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !25, line: 85, baseType: !185, size: 128)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !25, line: 85, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !185, file: !25, line: 86, baseType: !90, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dstv6", scope: !185, file: !25, line: 87, baseType: !93, size: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !25, line: 89, baseType: !36, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !176, file: !74, line: 72, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 131072, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 4096)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !176, file: !74, line: 73, baseType: !46, size: 64, offset: 256)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "reals_stats", scope: !2, file: !74, line: 83, type: !198, isLocal: false, isDefinition: true)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 77, size: 320, elements: !199)
!199 = !{!200, !203, !204, !210, !211}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !74, line: 78, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, elements: !38)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !198, file: !74, line: 79, baseType: !18, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !74, line: 80, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_stats", file: !25, line: 93, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !206, file: !25, line: 94, baseType: !31, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !206, file: !25, line: 95, baseType: !31, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !198, file: !74, line: 81, baseType: !191, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !198, file: !74, line: 82, baseType: !46, size: 64, offset: 256)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "stats", scope: !2, file: !74, line: 92, type: !214, isLocal: false, isDefinition: true)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 86, size: 320, elements: !215)
!215 = !{!216, !217, !218, !219, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !74, line: 87, baseType: !201, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !214, file: !74, line: 88, baseType: !18, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !214, file: !74, line: 89, baseType: !205, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !214, file: !74, line: 90, baseType: !220, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32768, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !214, file: !74, line: 91, baseType: !46, size: 64, offset: 256)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "server_id_map", scope: !2, file: !74, line: 102, type: !227, isLocal: false, isDefinition: true)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 96, size: 320, elements: !228)
!228 = !{!229, !230, !231, !232, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !74, line: 97, baseType: !12, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !227, file: !74, line: 98, baseType: !18, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !74, line: 99, baseType: !18, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !227, file: !74, line: 100, baseType: !233, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 536870848, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 16777214)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !227, file: !74, line: 101, baseType: !46, size: 64, offset: 256)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "decap_counters", scope: !2, file: !240, line: 44, type: !241, isLocal: false, isDefinition: true)
!240 = !DIFile(filename: "./decap_maps.h", directory: "/home/sayandes/codequery/extraction")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 38, size: 320, elements: !242)
!242 = !{!243, !244, !245, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !240, line: 39, baseType: !201, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !241, file: !240, line: 40, baseType: !18, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !240, line: 41, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decap_stats", file: !240, line: 31, size: 192, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v4", scope: !247, file: !240, line: 32, baseType: !31, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "decap_v6", scope: !247, file: !240, line: 33, baseType: !31, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !247, file: !240, line: 34, baseType: !31, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !241, file: !240, line: 42, baseType: !220, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !241, file: !240, line: 43, baseType: !46, size: 64, offset: 256)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 32, elements: !63)
!255 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!256 = !{i32 7, !"Dwarf Version", i32 4}
!257 = !{i32 2, !"Debug Info Version", i32 3}
!258 = !{i32 1, !"wchar_size", i32 4}
!259 = !{!"clang version 10.0.0-4ubuntu1 "}
